# 3rd November 2019

Reading And Writing Data in Text Format

In [2]:
import pandas as pd

In [21]:
test1 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data.csv")

In [22]:
test1

           Name      Father Name   Age        Address       Phone
0        Salman      Abdul Rahim    19     Kumharwada  3208314494
1        Nabeel   Muhammad Iqbal    20        8 Chowk  3172769963
2   Uzaif Ahmed     Bashir Ahmed    20       Baghdadi  3339356684
3  Raheel Ahmed    Muhammad Umer    22   Ghareeb Shah  3182116847

In [23]:
test2 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data2.csv")

In [24]:
test2

  emp_ID  emp_Name    Dept
0    NaN      Inam      AI
1    C45       NaN   Cloud
2    A23     Uzair     NaN

In [25]:
test1.describe()

             Age         Phone
count   4.000000  4.000000e+00
mean   20.250000  3.225639e+09
std     1.258306  7.728985e+07
min    19.000000  3.172770e+09
25%    19.750000  3.179780e+09
50%    20.000000  3.195216e+09
75%    20.500000  3.241075e+09
max    22.000000  3.339357e+09

In [26]:
test3 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data3.csv" ,sep=" ") #sep

In [27]:
test3

  emp_ID emp_Name     Dept
0    A78     Inam       AI
1    C45    Waqas    Cloud
2    A23    Uzair  Android

In [28]:
test4= !cat C:/Users/hp/Desktop/PIAIC/Class6/data2.csv

In [29]:
test4

["'cat' is not recognized as an internal or external command,",
 'operable program or batch file.']

In [14]:
test5= pd.read_clipboard()

In [15]:
test5

Empty DataFrame
Columns: [C:\Users\hp\Desktop]
Index: []

In [16]:
clip = pd.read_clipboard()
clip

Empty DataFrame
Columns: [C:\Users\hp\Desktop]
Index: []

In [34]:
test6 = pd.read_html("C:/Users/hp/Desktop/Project01.html")

In [38]:
test6[0]

,0,1,2,3,4,5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.999now in Rs.749,Rs.799now in Rs.599,Rs.999now in Rs.749,Rs.1199now in Rs.899
2,NaN,NaN,NaN,NaN,NaN,NaN
3,Rs.999now in Rs.749,Rs.999now in Rs.749,Rs.1199now in Rs.899,Rs.999now in Rs.749,Rs.999now in Rs.749,Rs.899now in Rs.674
4,NaN,NaN,NaN,NaN,NaN,NaN
5,Rs.1499now in Rs.1125,Rs.999now in Rs.749,Rs.799now in Rs.599,Rs.999now in Rs.749,Rs.799now in Rs.599,Rs.799now in Rs.599
6,NaN,NaN,NaN,NaN,NaN,NaN
7,Rs.599now in Rs.449,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599
8,NaN,NaN,NaN,NaN,NaN,NaN
9,Rs.599now in Rs.449,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599
10,NaN,NaN,NaN,NaN,NaN,NaN
11,Rs.599now in Rs.449,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599
12,NaN,NaN,NaN,NaN,NaN,NaN
13,Rs.599now in Rs.449,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599
14,NaN,NaN,NaN,NaN,NaN,NaN
15,Rs.599now in Rs.449,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599,Rs.799now in Rs.599

In [41]:
!cat C:/Users/hp/Desktop/PIAIC/Class6/data4.csv 
"a,b,c,d,message 1,2,3,4,hello 5,6,7,8,world9,10,11,12,foot"

'cat' is not recognized as an internal or external command,
operable program or batch file.

'a,b,c,d,message 1,2,3,4,hello 5,6,7,8,world9,10,11,12,foot'

In [43]:
test2 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data2.csv", header=None)
test2

        0          1       2
0  emp_ID   emp_Name    Dept
1     NaN       Inam      AI
2     C45        NaN   Cloud
3     A23      Uzair     NaN

In [47]:
test2 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data2.csv", header=None, names=["Emp_ID", "Emp_Name","Depart"],index_col="Depart")
test2

        Emp_ID   Emp_Name
Depart
 Dept   emp_ID   emp_Name
 AI        NaN       Inam
 Cloud     C45        NaN
NaN        A23      Uzair

In [52]:
test7 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data.csv",)
test7

           Name      Father Name   Age        Address       Phone
0        Salman      Abdul Rahim    19     Kumharwada  3208314494
1        Nabeel   Muhammad Iqbal    20        8 Chowk  3172769963
2   Uzaif Ahmed     Bashir Ahmed    20       Baghdadi  3339356684
3  Raheel Ahmed    Muhammad Umer    22   Ghareeb Shah  3182116847

In [56]:
test2 = pd.read_csv("C:/Users/hp/Desktop/PIAIC/Class6/data2.csv", na_values={"emp_ID": "&","emp_Name": "-","Dept": "^"})
test2

  emp_ID  emp_Name    Dept
0    NaN      Inam      AI
1    C45         -   Cloud
2    A23     Uzair       ^